Catalogs/упКлассыОпасности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упКлассыОпасности</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Класс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/упКлассыОпасности/Ext/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

// Процедура производит первоначальное заполнение предопределенных элементов справочника.
//
Процедура ПервоначальноеЗаполнение() Экспорт
	
	текЭлемент = Справочники.упКлассыОпасности.Класс1.ПолучитьОбъект();
	текЭлемент.Класс       = 10;
	текЭлемент.Комментарий = НСтр("ru = 'Взрывчатые материалы, которые по своим свойствам могут взрываться, вызывать пожар с взрывчатым действием, а также устройства, содержащие взрывчатые вещества и средства взрывания, предназначенные для производства пиротехнического эффекта.'");
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упКлассыОпасности.Подкласс1_1.ПолучитьОбъект();
	текЭлемент.Класс       = 11;
	текЭлемент.Комментарий = НСтр("ru = 'Взрывчатые и пиротехнические вещества и изделия с опасностью взрыва массой, когда взрыв мгновенно охватывает весь груз.'");
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упКлассыОпасности.Подкласс1_2.ПолучитьОбъект();
	текЭлемент.Класс       = 12;
	текЭлемент.Комментарий = НСтр("ru = 'Взрывчатые и пиротехнические вещества и изделия, не взрывающиеся массой.'");
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упКлассыОпасности.Подкласс1_3.ПолучитьОбъект();
	текЭлемент.Класс       = 13;
	текЭлемент.Комментарий = НСтр("ru = 'Взрывчатые и пиротехнические вещества и изделия, обладающие опасностью загорания с незначительным взрывчатым действием или без него.'");
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упКлассыОпасности.Подкласс1_4.ПолучитьОбъект();
	текЭлемент.Класс       = 14;
	текЭлемент.Комментарий = НСтр("ru = 'Взрывчатые и пиротехнические вещества и изделия, представляющие незначительную опасность взрыва во время транспортировки только в случае воспламенения или инициирования, не дающие разрушения устройств и упаковок.'");
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упКлассыОпасности.Подкласс1_5.ПолучитьОбъект();
	текЭлемент.Класс       = 15;
	текЭлемент.Комментарий = НСтр("ru = 'Взрывчатые вещества с опасностью взрыва массой, которые настолько нечувствительны, что при транспортировании инициирование или переход от горения к детонации маловероятны.'");
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упКлассыОпасности.Подкласс1_6.ПолучитьОбъект();
	текЭлемент.Класс       = 16;
	текЭлемент.Комментарий = НСтр("ru = 'Изделия, содержащие исключительно нечувствительные к детонации вещества, не взрывающиеся массой и характеризующиеся низкой вероятностью случайного инициирования.'");
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упКлассыОпасности.Класс2.ПолучитьОбъект();
	текЭлемент.Класс       = 20;
	текЭлемент.Комментарий = НСтр("ru = 'Газы сжатые, сжиженные охлаждением и растворенные под давлением, отвечающие хотя бы одному из следующих условий:
									    |- абсолютное давление паров при температуре 50С равно или выше 3 кгс/смЧЗОО кПа);
    								    |- критическая температура ниже 50С. По физическому состоянию газы делятся на:
    								    |- сжатые, критическая температура которых ниже -10С;
    								    |- сжиженные, критическая температура которых равна или выше -10С, но ниже 70С;
    								    |- сжиженные, критическая температура которых равна или выше 70С;
    								    |- растворенные под давлением;
    								    |- сжиженные переохлаждением;
    								    |- аэрозоли и сжатые газы, попадающие под действие специальных предписаний.'");
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упКлассыОпасности.Подкласс2_1.ПолучитьОбъект();
	текЭлемент.Класс       = 21;
	текЭлемент.Комментарий = НСтр("ru = 'Невоспламеняющиеся газы.'");
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упКлассыОпасности.Подкласс2_2.ПолучитьОбъект();
	текЭлемент.Класс       = 22;
	текЭлемент.Комментарий = НСтр("ru = 'Невоспламеняющиеся ядовитые газы.'");
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упКлассыОпасности.Подкласс2_3.ПолучитьОбъект();
	текЭлемент.Класс       = 23;
	текЭлемент.Комментарий = НСтр("ru = 'Легковоспламеняющиеся газы.'");
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упКлассыОпасности.Подкласс2_4.ПолучитьОбъект();
	текЭлемент.Класс       = 24;
	текЭлемент.Комментарий = НСтр("ru = 'Легковоспламеняющиеся ядовитые газы.'");
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упКлассыОпасности.Подкласс2_5.ПолучитьОбъект();
	текЭлемент.Класс       = 25;
	текЭлемент.Комментарий = НСтр("ru = 'Химически неустойчивые газы.'");
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упКлассыОпасности.Подкласс2_6.ПолучитьОбъект();
	текЭлемент.Класс       = 26;
	текЭлемент.Комментарий = НСтр("ru = 'Химически неустойчивые ядовитые газы.'");
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упКлассыОпасности.Класс3.ПолучитьОбъект();
	текЭлемент.Класс       = 30;
	текЭлемент.Комментарий = НСтр("ru = 'Легковоспламеняющиеся жидкости, смеси жидкостей, а также жидкости, содержащие твердые вещества в растворе или суспензии, которые выделяют легковоспламеняющиеся пары, имеющие температуру вспышки в закрытом тигле 61С и ниже.'");
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упКлассыОпасности.Подкласс3_1.ПолучитьОбъект();
	текЭлемент.Класс       = 31;
	текЭлемент.Комментарий = НСтр("ru = 'Легковоспламеняющиеся жидкости с низкой температурой вспышки и жидкости, имеющие температуру вспышки в закрытом тигле ниже минус 18С или имеющие температуру вспышки в сочетании с другими опасными свойствами, кроме легковоспламеняемости.'");
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упКлассыОпасности.Подкласс3_2.ПолучитьОбъект();
	текЭлемент.Класс       = 32;
	текЭлемент.Комментарий = НСтр("ru = 'Легковоспламеняющиеся жидкости со средней температурой вспышки - жидкости с температурой вспышки в закрытом тигле от минус 18 до плюс 23С.'");
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упКлассыОпасности.Подкласс3_3.ПолучитьОбъект();
	текЭлемент.Класс       = 33;
	текЭлемент.Комментарий = НСтр("ru = 'Лекговоспламеняющиеся жидкости с высокой температурой вспышки - жидкости с температурой вспышки от 23 до 61С включительно в закрытом тигле.'");
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упКлассыОпасности.Класс4.ПолучитьОбъект();
	текЭлемент.Класс       = 40;
	текЭлемент.Комментарий = НСтр("ru = 'Легковоспламеняющиеся вещества и материалы (кроме классифицированных как взрывчатые), способные во время перевозки легко загораться от внешних источников воспламенения, в результате трения, поглощения влаги, самопроизвольных химических превращений, а также при нагревании.'");
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упКлассыОпасности.Подкласс4_1.ПолучитьОбъект();
	текЭлемент.Класс       = 41;
	текЭлемент.Комментарий = НСтр("ru = 'Легковоспламеняющиеся твердью вещества, способные легко воспламеняться от кратковременного воздействия внешних источников воспламенения (искры, пламени или трения) и активно гореть.'");
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упКлассыОпасности.Подкласс4_2.ПолучитьОбъект();
	текЭлемент.Класс       = 42;
	текЭлемент.Комментарий = НСтр("ru = 'Самовоспламеняющиеся вещества, которые в обычных условиях транспортирования могут самопроизвольно нагреваться и воспламеняться.'");
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упКлассыОпасности.Подкласс4_3.ПолучитьОбъект();
	текЭлемент.Класс       = 43;
	текЭлемент.Комментарий = НСтр("ru = 'Вещества, выделяющие воспламеняющиеся газы при взаимодействии с водой.'");
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упКлассыОпасности.Класс5.ПолучитьОбъект();
	текЭлемент.Класс       = 50;
	текЭлемент.Комментарий = НСтр("ru = 'Окисляющие вещества и органические пероксиды, которые способны легко выделять кислород, поддерживать горение, а также могут, в соответствующих условиях или в смеси с другими веществами, вызвать самовоспламенение и взрыв.'");
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упКлассыОпасности.Подкласс5_1.ПолучитьОбъект();
	текЭлемент.Класс       = 51;
	текЭлемент.Комментарий = НСтр("ru = 'Окисляющие вещества, которые сами по себе не горючи, но способствуют легкой воспламеняемости других веществ и выделяют кислород при горении, тем самым увеличивая интенсивность огня.'");
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упКлассыОпасности.Подкласс5_2.ПолучитьОбъект();
	текЭлемент.Класс       = 52;
	текЭлемент.Комментарий = НСтр("ru = 'Органические пероксиды, которые в большинстве случаев горючи, могут действовать как окисляющие вещества и опасно взаимодействовать с другими веществами. Многие из них легко загораются и чувствительны к удару и трению.'");
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упКлассыОпасности.Класс6.ПолучитьОбъект();
	текЭлемент.Класс       = 60;
	текЭлемент.Комментарий = НСтр("ru = 'Ядовитые и инфекционные вещества, способные вызывать смерть, отравление или заболевание при попадании внутрь организма или при соприкосновении с кожей и слизистой оболочкой.'");
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упКлассыОпасности.Подкласс6_1.ПолучитьОбъект();
	текЭлемент.Класс       = 61;
	текЭлемент.Комментарий = НСтр("ru = 'Ядовитые (токсичные) вещества, способные вызвать отравление при вдыхании (паров, пыли), попадании внутрь или контакте с кожей.'");
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упКлассыОпасности.Подкласс6_2.ПолучитьОбъект();
	текЭлемент.Класс       = 62;
	текЭлемент.Комментарий = НСтр("ru = 'Вещества и материалы, содержащие болезнетворные микроорганизмы, опасные для людей и животных.'");
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упКлассыОпасности.Класс7.ПолучитьОбъект();
	текЭлемент.Класс       = 70;
	текЭлемент.Комментарий = НСтр("ru = 'Радиоактивные вещества с удельной активностью более 70 кБк/кг (2 нКи/г).'");
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упКлассыОпасности.Класс8.ПолучитьОбъект();
	текЭлемент.Класс       = 80;
	текЭлемент.Комментарий = НСтр("ru = 'Едкие и коррозионные вещества, которые вызывают повреждение кожи, поражение слизистых оболочек глаз и дыхательных путей, коррозию металлов и повреждения транспортных средств, сооружений или грузов, а также могут вызывать пожар при взаимодействии с органическими материалами или некоторыми химическими веществами.'");
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упКлассыОпасности.Подкласс8_1.ПолучитьОбъект();
	текЭлемент.Класс       = 81;
	текЭлемент.Комментарий = НСтр("ru = 'Кислоты'");
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упКлассыОпасности.Подкласс8_2.ПолучитьОбъект();
	текЭлемент.Класс       = 82;
	текЭлемент.Комментарий = НСтр("ru = 'Щелочи'");
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упКлассыОпасности.Подкласс8_3.ПолучитьОбъект();
	текЭлемент.Класс       = 83;
	текЭлемент.Комментарий = НСтр("ru = 'Разные едкие и коррозионные вещества'");
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упКлассыОпасности.Класс9.ПолучитьОбъект();
	текЭлемент.Класс       = 90;
	текЭлемент.Комментарий = НСтр("ru = 'Вещества с относительно низкой опасностью при транспортировании, не отнесенные ни к одному из предыдущих классов, но требующих применения к ним определенных правил перевозки и хранения.'");
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упКлассыОпасности.Подкласс9_1.ПолучитьОбъект();
	текЭлемент.Класс       = 91;
	текЭлемент.Комментарий = НСтр("ru = 'Твердые и жидкие горючие вещества и материалы, которые по своим свойствам не относятся к 3 и 4-му классам, но при определенных условиях могут быть опасными в пожарном отношении (горючие жидкости с температурой вспышки от +61 C до +100 C в закрытом сосуде, волокна и другие аналогичные материалы).'");
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упКлассыОпасности.Подкласс9_2.ПолучитьОбъект();
	текЭлемент.Класс       = 92;
	текЭлемент.Комментарий = НСтр("ru = 'Вещества, становящиеся едкими и коррозионными при определенных условиях.'");
	текЭлемент.Записать();
	
КонецПроцедуры	

#КонецОбласти
